Revit 2027 API
ZoomType Enumeration
 An enumerated type listing all Zoom types of Print Setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ZoomType
Public Enumeration ZoomType
public enum class ZoomType
type ZoomType
Members
Member name | Value | Description
FitToPage | 0 |  The type of Zoom is Fit To Page.
Zoom | 1 |  The type of Zoom is user defined.
See Also
Reference
Autodesk.Revit.DB Namespace